Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
module.kubernetes.module.grafana.helm_release.promtail: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.loki will be created
+ resource "helm_release" "loki" {
      + atomic                     = false
      + chart                      = "loki"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + "",
        ]
      + verify                     = false
      + version                    = "5.35.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.grafana.helm_release.promtail will be updated in-place
~ resource "helm_release" "promtail" {
        id                         = "promtail"
      ~ metadata                   = [
          - {
              - app_version = "2.9.2"
              - chart       = "promtail"
              - name        = "promtail"
              - namespace   = "grafana"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - initContainer = {
                          - enabled                   = true
                          - fsInotifyMaxUserInstances = 512
                        }
                    }
                )
              - version     = "6.15.3"
            },
        ] -> (known after apply)
        name                       = "promtail"
      ~ status                     = "failed" -> "deployed"
      + values                     = [
          + <<-EOT
                initContainer:
                  enabled: true
                  fsInotifyMaxUserInstances: 512
            EOT,
        ]
        # (25 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`